Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70J20.atdf
                <register offset="0x00000014" size="4" name="MVFR1" initval="0x11000011" rw="R" caption="Media and VFP Feature Register 1">
                    <bitfield mask="0x0000000F" name="FtZ_mode" caption="Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation"/>
                    <bitfield mask="0x000000F0" name="D_NaN_mode" caption="Indicates whether the FP hardware implementation supports only the Default NaN mode"/>
                    <bitfield mask="0x0F000000" name="FP_HPFP" caption="Floating Point Half-Precision and double-precision"/>
                    <bitfield mask="0xF0000000" name="FP_fused_MAC" caption="Indicates whether the FP supports fused multiply accumulate operations"/>
                </register>
                <register offset="0x00000018" size="4" name="MVFR2" initval="0x00000040" rw="R" caption="Media and VFP Feature Register 2">
                    <bitfield mask="0x000000F0" name="VFP_Misc" caption="Indicates the hardware support for FP miscellaneous features"/>
                </register>
                
            </register-group>
        </module>
  </modules>
  <pinouts>
    <pinout name="LQFP64">
      <pin position="40" pad="PA3"/>
      <pin position="34" pad="PA4"/>
      <pin position="32" pad="PA5"/>
      <pin position="15" pad="PA7"/>
      <pin position="16" pad="PA8"/>
      <pin position="33" pad="PA9"/>
      <pin position="28" pad="PA10"/>
      <pin position="27" pad="PA11"/>
      <pin position="29" pad="PA12"/>
      <pin position="18" pad="PA13"/>
      <pin position="19" pad="PA14"/>
      <pin position="12" pad="PA21"/>
      <pin position="17" pad="PA22"/>
      <pin position="23" pad="PA24"/>
      <pin position="30" pad="PA27"/>
      <pin position="8" pad="PB0"/>
      <pin position="7" pad="PB1"/>
      <pin position="9" pad="PB2"/>
      <pin position="11" pad="PB3"/>
      <pin position="46" pad="PB4"/>
      <pin position="47" pad="PB5"/>
      <pin position="35" pad="PB6"/>
      <pin position="39" pad="PB7"/>
      <pin position="62" pad="PB8"/>
      <pin position="63" pad="PB9"/>
      <pin position="38" pad="PB12"/>
      <pin position="1" pad="PD0"/>
      <pin position="57" pad="PD1"/>
      <pin position="56" pad="PD2"/>
      <pin position="55" pad="PD3"/>
      <pin position="54" pad="PD4"/>
      <pin position="53" pad="PD5"/>
      <pin position="51" pad="PD6"/>
      <pin position="50" pad="PD7"/>
      <pin position="49" pad="PD8"/>
      <pin position="48" pad="PD9"/>
      <pin position="44" pad="PD10"/>
      <pin position="43" pad="PD11"/>
      <pin position="41" pad="PD12"/>
      <pin position="26" pad="PD21"/>
      <pin position="25" pad="PD22"/>
      <pin position="22" pad="PD24"/>
      <pin position="20" pad="PD25"/>
      <pin position="21" pad="PD26"/>
      <pin position="2" pad="PD31"/>
      <pin position="3" pad="VDDOUT"/>
      <pin position="4" pad="VDDIN"/>
      <pin position="5" pad="VREFP"/>
      <pin position="36" pad="NRST"/>
      <pin position="37" pad="TST"/>
      <pin position="10" pad="VDDIO"/>
      <pin position="42" pad="VDDIO"/>
      <pin position="58" pad="VDDIO"/>
      <pin position="45" pad="JTAGSEL"/>
      <pin position="13" pad="VDDCORE"/>
      <pin position="24" pad="VDDCORE"/>
      <pin position="61" pad="VDDCORE"/>
      <pin position="52" pad="VDDPLL"/>
      <pin position="59" pad="DM"/>
      <pin position="60" pad="DP"/>
      <pin position="6" pad="GND"/>
      <pin position="14" pad="GND"/>
      <pin position="31" pad="GND"/>
      <pin position="64" pad="VDDPLLUSB"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>